Тест_ЗУП_31_КОРП/src/Catalogs/ВидыСтажа/ВидыСтажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСтажа</name>
  <attributes>
    <name>КатегорияСтажа</name>
    <type>
      <types>EnumRef.КатегорииСтажа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/КатегорииСтажа/КатегорииСтажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииСтажа</name>
  <enumValues>
    <name>ВыслугаЛет</name>
  </enumValues>
  <enumValues>
    <name>Медицинский</name>
  </enumValues>
  <enumValues>
    <name>Непрерывный</name>
  </enumValues>
  <enumValues>
    <name>Общий</name>
  </enumValues>
  <enumValues>
    <name>ОбщийНаучноПедагогический</name>
  </enumValues>
  <enumValues>
    <name>Педагогический</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>РасширенныйСтраховой</name>
  </enumValues>
  <enumValues>
    <name>Северный</name>
  </enumValues>
  <enumValues>
    <name>Страховой</name>
  </enumValues>
  <enumValues>
    <name>ВыслугаЛетНаГосударственнойСлужбе</name>
  </enumValues>
  <enumValues>
    <name>ВыслугаЛетНаВоеннойСлужбе</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ВидыСтажа/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("КатегорияСтажа", КатегорияСтажа);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыСтажа.Ссылка
	               |ИЗ
	               |	Справочник.ВидыСтажа КАК ВидыСтажа
	               |ГДЕ
	               |	ВидыСтажа.КатегорияСтажа = &КатегорияСтажа
	               |	И ВидыСтажа.КатегорияСтажа <> ЗНАЧЕНИЕ(Перечисление.КатегорииСтажа.ПустаяСсылка)
	               |	И ВидыСтажа.КатегорияСтажа <> ЗНАЧЕНИЕ(Перечисление.КатегорииСтажа.Прочее)
	               |	И ВидыСтажа.Ссылка <> &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		ТекстСообщения = НСтр("ru = 'Вид стажа данной категории уже существует.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "КатегорияСтажа", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
